public/old/termux-chroot-into-arch-linux/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Termux Chroot Into Arch Linux</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.27.0/themes/prism-tomorrow.min.css" rel="stylesheet">
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Termux Chroot Into Arch Linux</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Preface</a>
</li>
<li><a href="#headline-2">Why should I use chroot/proot instead of Termux natively</a>
</li>
<li><a href="#headline-3">Setting up the Chroot Environment</a>
<ul>
<li><a href="#headline-4">Downloading the Arch RootFS</a>
</li>
<li><a href="#headline-5">Extracting the Tarball</a>
</li>
<li><a href="#headline-6">Chrooting</a>
</li>
</ul>
</li>
<li><a href="#headline-7">Recommendation</a>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Preface
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>Here&#39;s how to chroot into an Arch Linux Arm installation from Termux. This will
require a rooted android and a little bit of time</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Why should I use chroot/proot instead of Termux natively
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>Chrooting into an offical linux image will give you the same package support as
any other distribution. You can install packages like qemu, not deal with broken
termux dependencies, and properly follow guides on compiling software. You can
also have different environments and run multiple official distributions of
linux in one termux instance</p>
<p>
The official Termux documentations suggests using PROOT to chroot into a rootfs
without requiring root privledges. This is a userspace implentation of the
chroot that hijacks some system calls to make the chroot work without root. It&#39;s
quite a bit slower than native chroot so I prefer chroot itself.</p>
<p>
Setting up Proot on android is a lot easier than using chroot. If you don&#39;t care
about the performance loss, follow this guide: <a href="https://wiki.termux.com/wiki/PRoot">https://wiki.termux.com/wiki/PRoot</a></p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Setting up the Chroot Environment
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Downloading the Arch RootFS
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>This is Arch Linux ARM (alarma). The arm image is required since we&#39;re on
Android and want to avoid emulating other architectures to chroot</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>mkdir Alarm ; cd Alarm
</span></span><span style="display:flex;"><span>wget http://os.archlinuxarm.org/os/ArchLinuxARM-aarch64-latest.tar.gz</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Extracting the Tarball
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Per the ALARM instruction for extracting the tarbar, we&#39;ll use BSD tar instead
of the native tar. The documentation says to extract as the root user and <strong>not</strong>
as the sudo.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>pkg install bsdtar
</span></span><span style="display:flex;"><span>sudo su
</span></span><span style="display:flex;"><span>/data/data/com.termux/files/usr/bin/bsdtar -xpf ArchLinuxARM-aarch64-latest.tar.gz</span></span></code></pre></div>
</div>
<p>
When I extracted the file it had errors. I ignored these and it worked fine.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Chrooting
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>First mount the psuedo filesystems from your system onto the rootfs. Note that
we&#39;re still in the Alaram folder with the extracted files.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  mount -t proc /proc proc/
</span></span><span style="display:flex;"><span>  mount -t sysfs /sys sys/
</span></span><span style="display:flex;"><span>  mount --rbind /dev dev/</span></span></code></pre></div>
</div>
<p>
To make sure name resolution works in chroot, lets copy the resolve.conf file
from termux and into the rootfs folder</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>cp -f /data/data/com.termux/files/usr/etc/resolv.conf etc/resolv.conf
</span></span><span style="display:flex;"><span>chmod <span style="color:#ae81ff">0644</span> etc/resolv.conf</span></span></code></pre></div>
</div>
<p>
Now lets chroot! After chrooting we source the <code>/etc/profile</code> file so the PATH
variable gets loaded properly</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  chroot . /bin/bash
</span></span><span style="display:flex;"><span>  source /etc/profile</span></span></code></pre></div>
</div>
<p>
Now lets initialize the pacman keyring so we can install packages</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  pacman-key --init
</span></span><span style="display:flex;"><span>  pacman-key --populate archlinuxarm</span></span></code></pre></div>
</div>
<p>
Now lets stop pacman from checking if there&#39;s enough diskspace when upgrading
packages. There&#39;s a weird bug where if you try to install or upgrade any
program, pacman will report that the cache directory is full or it cant write to
it. The second sed command will enable parallel downloads</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  sed -i <span style="color:#e6db74">&#39;s/CheckSpace/#CheckSpace/g&#39;</span> /etc/pacman.conf
</span></span><span style="display:flex;"><span>  sed -i <span style="color:#e6db74">&#39;s/#ParallelDownloads = 5/ParallelDownloads = 5/g&#39;</span> /etc/pacman.conf</span></span></code></pre></div>
</div>
<p>
Finally we can upgrade the system!</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>pacman -Syyu</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
Recommendation
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>To make chrooting faster, create this shell script in the extracted Alarm
folder. Executing it will automatically do all the steps to chroot</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span><span style="color:#75715e">#!/bin/bash
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>basedir<span style="color:#f92672">=</span><span style="color:#66d9ef">$(</span>dirname $0<span style="color:#66d9ef">)</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#66d9ef">if</span> <span style="color:#f92672">[</span> <span style="color:#e6db74">&#34;</span>$EUID<span style="color:#e6db74">&#34;</span> -ne <span style="color:#ae81ff">0</span> <span style="color:#f92672">]</span>; <span style="color:#66d9ef">then</span>
</span></span><span style="display:flex;"><span>    echo <span style="color:#e6db74">&#34;Please run as root (NOT SUDO)&#34;</span>
</span></span><span style="display:flex;"><span>    exit
</span></span><span style="display:flex;"><span><span style="color:#66d9ef">fi</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>mount -t proc /proc proc/
</span></span><span style="display:flex;"><span>mount -t sysfs /sys sys/
</span></span><span style="display:flex;"><span>mount --rbind /dev dev/
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>chroot . /bin/bash</span></span></code></pre></div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
